In [1]:
import pandas as pd

In [2]:
record1 = pd.Series({
    'Name': 'Karteek',
    'Class': 'C#',
    'Score': 70
})

In [3]:
record2 = pd.Series({
    'Name': 'Sowjanya',
    'Class': 'Java',
    'Score': 72
})

In [4]:
record3 = pd.Series({
    'Name': 'Madhuri',
    'Class': 'Python',
    'Score': 90
})

In [5]:
record1

Name     Karteek
Class         C#
Score         70
dtype: object

In [6]:
df = pd.DataFrame([record1,record2,record3],
                 index = ['school1','school2','school1'])

In [7]:
df

             Name   Class  Score
school1   Karteek      C#     70
school2  Sowjanya    Java     72
school1   Madhuri  Python     90

In [8]:
students = [{
    'Name': 'Karteek',
    'Class': 'C#',
    'Score': 70
}, {
    'Name': 'Sowjanya',
    'Class': 'Java',
    'Score': 72
},{
    'Name': 'Madhuri',
    'Class': 'Python',
    'Score': 90
}]

df2 = pd.DataFrame(students,index=['school1','school2','school1'])

In [9]:
df2

             Name   Class  Score
school1   Karteek      C#     70
school2  Sowjanya    Java     72
school1   Madhuri  Python     90

In [16]:
df2.loc['school1']

            Name   Class  Score
school1  Karteek      C#     70
school1  Madhuri  Python     90

In [17]:
df2.loc['school1','Name']

school1    Karteek
school1    Madhuri
Name: Name, dtype: object

In [19]:
df2.T.loc['Name']

school1     Karteek
school2    Sowjanya
school1     Madhuri
Name: Name, dtype: object

In [21]:
df2['Name']

school1     Karteek
school2    Sowjanya
school1     Madhuri
Name: Name, dtype: object

In [22]:
type(df2['Name'])

pandas.core.series.Series

In [23]:
df2.loc['school1']['Name']

school1    Karteek
school1    Madhuri
Name: Name, dtype: object

In [24]:
type(df2.loc['school1']['Name'])

pandas.core.series.Series

In [28]:
df2.loc[:,['Name','Score']]

             Name  Score
school1   Karteek     70
school2  Sowjanya     72
school1   Madhuri     90

In [29]:
df2.loc[:]

             Name   Class  Score
school1   Karteek      C#     70
school2  Sowjanya    Java     72
school1   Madhuri  Python     90

In [31]:
df2.drop('school2')

            Name   Class  Score
school1  Karteek      C#     70
school1  Madhuri  Python     90

In [32]:
df2

             Name   Class  Score
school1   Karteek      C#     70
school2  Sowjanya    Java     72
school1   Madhuri  Python     90

In [33]:
copy_df = df.copy()

In [34]:
copy_df.drop("Name",inplace=True,axis=1)

In [35]:
copy_df

          Class  Score
school1      C#     70
school2    Java     72
school1  Python     90

In [36]:
del copy_df['Class']

In [37]:
copy_df

         Score
school1     70
school2     72
school1     90

In [38]:
df2['ClassRanking']=None
df2

             Name   Class  Score ClassRanking
school1   Karteek      C#     70         None
school2  Sowjanya    Java     72         None
school1   Madhuri  Python     90         None